"""

Задача 1. Вложенные условия (базовый синтаксис)

Условие:
Напишите программу, которая проверяет доступ к контенту 
по возрасту и подписке.

Логика:

    Если возраст >= 18, проверяем подписку:
        - Если есть подписка: "Полный доступ"
        - Если нет подписки: "Только бесплатный контент"
    Если возраст < 18:
        - "Доступ ограничен"

Пример входных данных:
    Возраст: 20
    Подписка: True
"""

age = 20 
has_subscribtion = True

if age >= 18:
    if has_subscribtion:
        print("Полный доступ")
    else:
        print("Только бесплатный контент")
else: 
    print("Доступ ограничен")

"""

Задача 2. Простой тернарный оператор (базовый синтаксис)

Условие:
Напишите программу, которая определяет статус заказа используя тернарный оператор.

Логика:

    Если заказ доставлен -> статус "Завершен"
    Иначе -> статус "В обработке"

Пример входных данных:
    Заказ доставлен: True
"""

is_delivered = True

print("Завершен") if is_delivered == True else print("В обработке") 

"""

Задача 3. Тернарный оператор с логическим И (and)

Условие:
Напишите программу, которая определяет скидку используя тернарный оператор с условием AND.

Логика:

    Если сумма покупки > 5000 И есть промокод -> скидка 15%
    Иначе -> скидка 5%

Пример входных данных:
    Сумма покупки: 6000
    Есть промокод: True
"""

total = 6000
is_promo = True

print("скидка 15%") if total > 5000 and is_promo else print("скидка 5%")

"""

Задача 4. Тернарный оператор с регулярными выражениями

Условие:
Напишите программу, которая проверяет email на валидность используя тернарный оператор и regex.

Логика:

    Если email содержит '@' и '.' -> "Валидный email"
    Иначе -> "Невалидный email"

Пример входных данных:
    Email: "user@example.com"
"""
import re

Email = "user@example.com"

print("Валидный email") if bool(re.search(r'\.', Email)) and bool(re.search(r'\@', Email)) else print("Невалидный email")

"""

Задача 5. Сложная проверка с регулярными выражениями

Условие:
Напишите программу, которая анализирует сложность пароля используя тернарный оператор и regex.

Логика:

    Если пароль содержит цифры И 
    буквы в верхнем и нижнем регистре И длиной >= 8 -> "Надежный пароль"
    Иначе если пароль содержит цифры ИЛИ буквы в разных регистрах -> 
    "Средний пароль"  
    Иначе -> "Слабый пароль"

Пример входных данных:
    Пароль: "Secure123"
"""

password = "Secure123"



"""

Бонусная задача. Многоуровневый тернарный оператор

Условие:
Напишите программу, которая определяет рейтинг товара используя многоуровневый тернарный оператор.
Логика:

    Если отзывов >= 100 -> "Популярный товар"
    Иначе если отзывов >= 50 -> "Востребованный товар" 
    Иначе если отзывов >= 10 -> "Обычный товар"
    Иначе -> "Новый товар"

Пример входных данных:
    Количество отзывов: 75
"""

### ваше решение здесь ###
